bench/results/java25/20260425T120511Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 300, "warmup_s": 120, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 5499.2, "p50": "4.18ms", "p95": "7.13ms", "p99": "8.29ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 5m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     4.36ms    1.29ms  26.15ms   72.72%\n    Req/Sec     1.38k   116.49     2.45k    73.08%\n  Latency Distribution\n     50%    4.18ms\n     75%    5.03ms\n     90%    5.98ms\n     99%    8.29ms\n  1650307 requests in 5.00m, 376.15MB read\nRequests/sec:   5499.20\nTransfer/sec:      1.25MB"}